---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.MaxRange
source: html/0003f9f7-1be6-9bcb-212a-d38767d01e10.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.MaxRange Property

The maximum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor.
 In the example above, the maximum range will be 3.

## Syntax (C#)
```csharp
public double MaxRange { get; set; }
```